src/mathematics/linear_algebra/KBrefEigenspace.org
:PROPERTIES:
:ID:       41B64D6B-49D3-4EC4-9251-5AF0425F3953
:END:
#+TITLE: Axler5.36 Eigenspace
* eigenspace, $E(\lambda, T)$                                           :def:
  #+begin_quote
  Suppose $T \in  \mathcal{L} (V)$ and $\lambda \in \mathbb{F}$. The /eigenspace/ of $T$ corresponding to $\lambda$ denoted $E(\lambda, T)$, is defined by
  \[\begin{aligned}
  E(\lambda , T) = \onull(T-\lambda I)
  \end{aligned}\]
  In other words, $E(\lambda , T)$ is the set of all eigenvectors of $T$ corresponding to $\lambda$, along with the 0 vector.
  #+end_quote
** results
*** $\lambda$ is an eigenvalue of $T$ iff $E(\lambda ,T) \neq  \{0\}$
*** Axler5.38 sum of eigenspaces is a direct sum
	Because [[id:5F3D94FC-E848-4F47-8769-83A20C8EBD70][Axler5.10 linearly independent eigenvectors]]

	Also, the dimension of the sum of eigenspaces will be less-equal than the dimension of the containing space (duh)
