docs/mathematics/linear_algebra/KBrefEigenspace.tex
% Created 2021-09-27 Mon 11:53
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\setlength{\parindent}{0pt}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{svg}
\usepackage{cancel}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\renewcommand{\tableofcontents}{}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Taproot}
\date{\today}
\title{Axler5.36 Eigenspace}
\hypersetup{
 pdfauthor={Taproot},
 pdftitle={Axler5.36 Eigenspace},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{eigenspace, \(E(\lambda, T)\)\hfill{}\textsc{def}}
\label{sec:org989494e}
\begin{quote}
Suppose \(T \in  \mathcal{L} (V)\) and \(\lambda \in \mathbb{F}\). The \emph{eigenspace} of \(T\) corresponding to \(\lambda\) denoted \(E(\lambda, T)\), is defined by
\[\begin{aligned}
  E(\lambda , T) = \onull(T-\lambda I)
  \end{aligned}\]
In other words, \(E(\lambda , T)\) is the set of all eigenvectors of \(T\) corresponding to \(\lambda\), along with the 0 vector.
\end{quote}
\subsection{results}
\label{sec:org731b53d}
\subsubsection{\(\lambda\) is an eigenvalue of \(T\) iff \(E(\lambda ,T) \neq  \{0\}\)}
\label{sec:org7590ab8}
\subsubsection{Axler5.38 sum of eigenspaces is a direct sum}
\label{sec:orgabe2b5a}
Because \href{KBrefEigenvaluesAndEigenVectors.org}{Axler5.10 linearly independent eigenvectors}

Also, the dimension of the sum of eigenspaces will be less-equal than the dimension of the containing space (duh)
\end{document}
